content-org/blog.org
#+TITLE: EmacsCast Episodes
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: blog
#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval never-export

#+OPTIONS: creator:t toc:nil

** DONE Episode 4: Spacemacs vs. Doom vs. Vanilla Emacs
CLOSED: [2018-09-05 Wed 16:16]
:PROPERTIES:
:EXPORT_FILE_NAME: episode_4
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :file_id "a6984553-56ca-40f3-a495-501780f7de26", :youtube_id "6xKzrcrv_fU", :reddit_url "https://www.reddit.com/r/emacs/comments/9d7rew/emacscast_episode_4_spacemacs_vs_doom_vs_vanilla/"
:END:

Few updates and an overview of two popular community-driven Emacs distributions, focused on Evil mode. Comparison with vanilla Emacs and your own config.

*** Shownotes

**** News
- [[https://emacscast.org][New Emacscast.org website]] ([[https://github.com/freetonik/emacscast.org][source]])
- [[https://gohugo.io/][Hugo]] static website generator
- [[https://github.com/kaushalmodi/ox-hugo][Ox-Hugo]]: A carefully crafted Org exporter back-end for Hugo
- [[https://emacsel.com/][Emacs.el podcast]]
- [[https://rakhim.org/][My personal blog]], powered by ox-hugo as well
- [[https://www.netlify.com/][Netlify]]
- [[https://github.com/freetonik/emacs-dotfiles][My current config]]

**** Support Emacs community developers
- *[[https://github.com/freetonik/support-emacs-community-devs][List of ways to support Emacs community developers]]*
- [[https://twitter.com/bzg2/status/970281120880300033][Bastien Guerry's tweet]]
- [[https://github.com/emacs-helm/helm/issues/2083][Helm development is stalled for now]]

**** Spacemacs
- [[http://spacemacs.org/][Spacemacs homepage]]
- [[http://spacemacs.org/layers/LAYERS.html][Layers]]

**** Doom
- [[https://github.com/hlissner/doom-emacs][Doom homepage]]
- [[https://github.com/hlissner/emacs-doom-themes][Doom themes]]
- [[https://github.com/hlissner/doom-emacs/tree/master/modules/ui/doom-modeline][Doom modeline]] (very pretty!)

**** Modal editing in Emacs
- [[https://github.com/emacs-evil/evil][Evil-mode]]
- [[https://github.com/chrisdone/god-mode][God mode]]
- [[https://github.com/mrkkrp/modalka][Modalka]]
- [[https://github.com/jyp/boon][Boon]]
- [[https://github.com/Kungsgeten/ryo-modal][RYO modal mode!]]
- [[https://github.com/fgeller/fingers.el][Fingers.el]]
- [[http://ergoemacs.org/misc/ergoemacs_vi_mode.html][Xah Fly Keys]]
