content/blog/episode_4.md
+++
title = "Episode 4: Spacemacs vs. Doom vs. Vanilla Emacs"
author = ["Rakhim Davletkaliyev"]
date = 2018-09-05T16:16:00+03:00
draft = false
creator = "Emacs 26.1 (Org mode 9.1.9 + ox-hugo)"
file_id = "a6984553-56ca-40f3-a495-501780f7de26"
youtube_id = "6xKzrcrv_fU"
+++

Few updates and an overview of two popular community-driven Emacs distributions, focused on Evil mode. Comparison with vanilla Emacs and your own config.


## Shownotes {#shownotes}


### News {#news}

-   [New Emacscast.org website](https://emacscast.org) ([source](https://github.com/freetonik/emacscast.org))
-   [Hugo](https://gohugo.io/) static website generator
-   [Ox-Hugo](https://github.com/kaushalmodi/ox-hugo): A carefully crafted Org exporter back-end for Hugo
-   [Emacs.el podcast](https://emacsel.com/)
-   [My personal blog](https://rakhim.org/), powered by ox-hugo as well
-   [Netlify](https://www.netlify.com/)
-   [My current config](https://github.com/freetonik/emacs-dotfiles)


### Support Emacs community developers {#support-emacs-community-developers}

-   **[List of ways to support Emacs community developers](https://github.com/freetonik/support-emacs-community-devs)**
-   [Bastien Guerry's tweet](https://twitter.com/bzg2/status/970281120880300033)
-   [Helm development is stalled for now](https://github.com/emacs-helm/helm/issues/2083)


### Spacemacs {#spacemacs}

-   [Spacemacs homepage](http://spacemacs.org/)
-   [Layers](http://spacemacs.org/layers/LAYERS.html)


### Doom {#doom}

-   [Doom homepage](https://github.com/hlissner/doom-emacs)
-   [Doom themes](https://github.com/hlissner/emacs-doom-themes)
-   [Doom modeline](https://github.com/hlissner/doom-emacs/tree/master/modules/ui/doom-modeline) (very pretty!)


### Modal editing in Emacs {#modal-editing-in-emacs}

-   [Evil-mode](https://github.com/emacs-evil/evil)
-   [God mode](https://github.com/chrisdone/god-mode)
-   [Modalka](https://github.com/mrkkrp/modalka)
-   [Boon](https://github.com/jyp/boon)
-   [RYO modal mode!](https://github.com/Kungsgeten/ryo-modal)
-   [Fingers.el](https://github.com/fgeller/fingers.el)
-   [Xah Fly Keys](http://ergoemacs.org/misc/ergoemacs%5Fvi%5Fmode.html)
